app/Models/main/AttachmentModel.php

SELECT `m_attachment`.*, `m_user`.`code` as `user`
FROM `m_attachment`
LEFT JOIN `m_user` ON `m_attachment`.`save_by` = `m_user`.`id`
WHERE `m_attachment`.`object` = 'employee'
AND `m_attachment`.`object_uniq` = ''
---
    public function getAttachment($object, $unique)
    {
        $query = $this->db->table('m_attachment');
        $query->select('m_attachment.*, m_user.code as user');
        $query->join('m_user', 'm_attachment.save_by = m_user.id', 'left');
        $query->where('m_attachment.object', $object)->where('m_attachment.object_uniq', $unique);
        return $query->get()->getResultArray();