app/Models/mix/MainModel.php

    public function distSelect($param, $group = false)
    {
        $builder = $this->db->table('m_select');
        ($group == false) ? $builder->select('*') : $builder->select('group')->distinct();
        $builder->where('param', $param);
        $builder->orderBy('number');
        return $builder->get()->getResult();
---
SELECT DISTINCT `group`
FROM `m_select`
WHERE `param` = 'ptkp'
ORDER BY `number`

    public function loadUser($isi, $idUser = false, $employee = false)
    {
        $builder = $this->db->table('m_user a');
        $builder->select('a.*, b.name as role, c.id as employee_id, c.name as employeeName');
        ($idUser == true ? $builder->where('a.id', $idUser) : $builder->where("(a.code like \"%$isi%\" or c.name like \"%$isi%\")"));
        $builder->where('substring(a.adaptation, 2, 1)', '1')->where('substring(a.adaptation, 3, 1)', '1');
        $joinCondition = ($employee != '' ? 'inner' : 'left');
        $builder->where(['a.deleted_at' => null]);
        $builder->join('m_role b', 'a.role_id=b.id', 'left');
        $builder->join('m_person c', 'a.id=c.user_id', $joinCondition);
        $builder->orderBy('a.code');
        $builder->limit(quantityLimit);
        return $builder->get()->getResult();
---
SELECT `a`.*, `b`.`name` as `role`, `c`.`id` as `employee_id`, `c`.`name` as `employeeName`
FROM `m_user` `a`
LEFT JOIN `m_role` `b` ON `a`.`role_id`=`b`.`id`
INNER JOIN `m_person` `c` ON `a`.`id`=`c`.`user_id`
WHERE (`a`.`code` like "%Administrator%" or `c`.`name` like "%Administrator%")
AND substring(a.adaptation, 2, 1) = '1'
AND substring(a.adaptation, 3, 1) = '1'
AND `a`.`deleted_at` IS NULL
ORDER BY `a`.`code`
 LIMIT 20

    public function getCompany($menu, $active = false)
    {
        $builder = $this->db->table('m_company a');
        $builder->select('a.*, b.code as person_code, b.name as person_name, x.id as xLog');
        if ($active == true) $builder->where('substring(a.adaptation, 2, 1)', '1')->where('substring(a.adaptation, 3, 1)', '1');
        $strX = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.username = "' . decrypt(session()->username) . '"' : '');
        $builder->join('m_person b', 'b.id = a.person_id', 'left');
        $builder->join('user_log x', 'x.unique = a.unique' . $strX, 'left');
        $builder->where(['a.deleted_at' => null]);
        $builder->groupBy('a.id')->orderBy('a.code');
        return $builder->get()->getResult();
---
SELECT `a`.*, `b`.`code` as `person_code`, `b`.`name` as `person_name`, `x`.`id` as `xLog`
FROM `m_company` `a`
LEFT JOIN `m_person` `b` ON `b`.`id` = `a`.`person_id`
LEFT JOIN `user_log` `x` ON `x`.`unique` = `a`.`unique`
WHERE substring(a.adaptation, 2, 1) = '1'
AND substring(a.adaptation, 3, 1) = '1'
AND `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `a`.`code`

    public function getFile($menu, $param, $active = false, $set_default = false)
    {
        $builder = $this->db->table('m_file a');
        $builder->select('a.*, b.code as company, c.name as region, d.name as division, p.code as save_by, x.id as xLog');
        if ($active == true) $builder->where('substring(a.adaptation, 2, 1)', '1')->where('substring(a.adaptation, 3, 1)', '1');
        if ($set_default == true) $builder->where('a.set_default', '1');
        $strX = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.username = "' . decrypt(session()->username) . '"' : '');
        $builder->join('m_company b', 'b.id = a.company_id', 'left');
        $builder->join('m_file c', 'c.id = a.region_id', 'left');
        $builder->join('m_file d', 'd.id = a.division_id', 'left');
        $builder->join('m_user p', 'p.id = a.save_by', 'left');
        $builder->join('user_log x', 'x.unique = a.unique' . $strX, 'left');
        $builder->where('a.param',  $param)->where(['a.deleted_at' => null]);
        $builder->groupBy('a.id')->orderBy('a.name');
        return $builder->get()->getResult();
---
SELECT `a`.*, `b`.`code` as `company`, `c`.`name` as `region`, `d`.`name` as `division`, `p`.`code` as `save_by`, `x`.`id` as `xLog`
FROM `m_file` `a`
LEFT JOIN `m_company` `b` ON `b`.`id` = `a`.`company_id`
LEFT JOIN `m_file` `c` ON `c`.`id` = `a`.`region_id`
LEFT JOIN `m_file` `d` ON `d`.`id` = `a`.`division_id`
LEFT JOIN `m_user` `p` ON `p`.`id` = `a`.`save_by`
LEFT JOIN `user_log` `x` ON `x`.`unique` = `a`.`unique`
WHERE substring(a.adaptation, 2, 1) = '1'
AND substring(a.adaptation, 3, 1) = '1'
AND `a`.`param` = 'region'
AND `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `a`.`name`

    public function getCost($menu, $param, $category)
    {
        $builder = $this->db->table('m_cost a');
        $builder->select('a.*, x.id as xLog');
        ($param == 'direct cost') ? $builder->where('a.category_id', $category) : $builder->like('a.code', $category, 'after');
        $builder->where('a.param', $param)->where(['a.deleted_at' => null]);
        $strX = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.username = "' . decrypt(session()->username) . '"' : '');
        $builder->join('user_log x', 'x.unique = a.unique' . $strX, 'left');
        $builder->groupBy('a.id')->orderBy('a.code');
        return $builder->get()->getResult();
---
SELECT `a`.*, `x`.`id` as `xLog`
FROM `m_cost` `a`
LEFT JOIN `user_log` `x` ON `x`.`unique` = `a`.`unique` AND `x`.`menu` = "advancepayment" AND `x`.`username` = "Administrator"
WHERE `a`.`code` LIKE 'XYZ%' ESCAPE '!'
AND `a`.`param` IS NULL
AND `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `a`.`code`

    public function distinctCost($param)
    {
        $builder = $this->db->table('m_cost');
        $builder->select('code, name')->distinct();
        $builder->where('param',  $param)->where('level', '1')->where(['deleted_at' => null]);
        $builder->orderBy('code');
        return $builder->get()->getResult();
---
SELECT DISTINCT `code`, `name`
FROM `m_cost`
WHERE `param` = 'indirect cost'
AND `level` = '1'
AND `deleted_at` IS NULL
ORDER BY `code`

    public function getBudget($menu, $global = '1', $unique = false, $object = false)
    {
        $builder = $this->db->table('m_budget1 a');
        if ($global == '1') {
            $builder->select('a.*, b.name as typeCode, x.id as xLog');
            $strX = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.username = "' . decrypt(session()->username) . '"' : '');
            $builder->join('m_cost b', 'a.type = b.code',  'left');
            $builder->join('user_log x', 'x.unique = a.unique' . $strX, 'left');
            $builder->where(['a.deleted_at' => null]);
            $builder->groupBy('a.id')->orderBy("a.object, a.title");
        } else {
            $builder->select('c.*, b.code as code, b.name as description, b.level as level');
            $builder->join('m_budget2 c', 'c.parent_id = a.id',  'left');
            $builder->where('a.unique', $unique)->where(['c.deleted_at' => null]);
            if ($object == 'project')
                $builder->join('m_cost b', 'c.cost_id=b.id', 'left');
            else
                $builder->join('m_account b', 'c.account_id=b.id', 'left');
            $builder->groupBy('c.id')->orderBy("b.code, c.id ");
        }
        return $builder->get()->getResult();
---
SELECT `c`.*, `b`.`code` as `code`, `b`.`name` as `description`, `b`.`level` as `level`
FROM `m_budget1` `a`
LEFT JOIN `m_budget2` `c` ON `c`.`parent_id` = `a`.`id`
LEFT JOIN `m_account` `b` ON `c`.`account_id`=`b`.`id`
WHERE `a`.`unique` = 'df4106ca114afbe236bd8ba16fff5290e47ac0104a8a70e2c41f4cab11576d8a'
AND `c`.`deleted_at` IS NULL
GROUP BY `c`.`id`
ORDER BY `b`.`code`, `c`.`id`

    public function loadGA_COA($AccountID, $field)
    {
        $builder = $this->db->table('group_account a');
        $builder->select('b.id, b.code, b.name');
        $builder->where('a.id', $AccountID)->where(['a.deleted_at' => null]);
        $builder->where(['b.deleted_at' => null]);
        $builder->join('m_account b', 'a.' . $field . ' = b.id', 'left');
        return $builder->get()->getResult();
---
SELECT `b`.`id`, `b`.`code`, `b`.`name`
FROM `group_account` `a`
LEFT JOIN `m_account` `b` ON `a`.`account1_id` = `b`.`id`
WHERE `a`.`id` = '2'
AND `a`.`deleted_at` IS NULL
AND `b`.`deleted_at` IS NULL

    public function getCashAccount(string $cash)
    {
        $cash = trim($cash, ',');
        $builder = $this->db->table('m_user a');
        $builder->select('b.name as groupName, c.id as accountID, c.code as accountCode, c.name as accountName');
        $builder->join('group_account b', "FIND_IN_SET(b.id, a.cash) > 0", 'inner');
        $builder->join('m_account c', 'b.account1_id = c.id', 'left');
        return $builder->get()->getResult();
---
SELECT `b`.`name` as `groupName`, `c`.`id` as `accountID`, `c`.`code` as `accountCode`, `c`.`name` as `accountName`
FROM `m_user` `a`
INNER JOIN `group_account` `b` ON FIND_IN_SET(b.id, a.cash) > 0
LEFT JOIN `m_account` `c` ON `b`.`account1_id` = `c`.`id`

    public function loadGroupAccount($param, $subparam, $source = false)
    {
        $builder = $this->db->table('group_account');
        $builder->where('param', $param);
        if ($subparam != '') $builder->where('sub_param', $subparam);
        if ($source == true) $builder->where('source', $source);
        $builder->where('substring(adaptation, 2, 1)', '1')->where('substring(adaptation, 3, 1)', '1');
        $builder->where(['deleted_at' => null]);
        $builder->orderBy('name');
        return $builder->get()->getResult();
---
SELECT *
FROM `group_account`
WHERE `param` = 'asset'
AND `sub_param` = 'equipment tool'
AND substring(adaptation, 2, 1) = '1'
AND substring(adaptation, 3, 1) = '1'
AND `deleted_at` IS NULL
ORDER BY `name`

    public function getTool($menu, $active = false, $param = false, $company = false, $partner = false, $category = false)
    {
        $builder = $this->db->table('m_tool a');
        $builder->select('a.*, b.code as company, c.name as region, d.name as division, e.name as partner_name, x.id as xLog');
        if ($param == true) ($param == 'multi') ? $builder->whereIn('a.param', ['equipment', 'tool']) : $builder->where('a.param', $param);
        if ($active == true) $builder->where('substring(a.adaptation, 2, 1)', '1')->where('substring(a.adaptation, 3, 1)', '1');
        if ($company == true) $builder->where('a.company_id', $company);
        if ($category == true) $builder->where('a.category', $category);
        if ($param == 'partner') $builder->where('a.partner_id', $partner);
        $strX = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.username = "' . decrypt(session()->username) . '"' : '');
        $builder->where(['a.deleted_at' => null]);
        $builder->join('m_company b', 'a.company_id=b.id', 'left');
        $builder->join('m_file c', 'a.region_id=c.id', 'left');
        $builder->join('m_file d', 'a.division_id=d.id', 'left');
        $builder->join('m_person e', 'a.person_id=e.id', 'left');
        $builder->join('user_log x', 'x.unique = a.unique' . $strX, 'left');
        $builder->groupBy('a.id')->orderBy('a.code');
        return $builder->get()->getResult();
---
SELECT `a`.*, `b`.`code` as `company`, `c`.`name` as `region`, `d`.`name` as `division`, `e`.`name` as `partner_name`, `x`.`id` as `xLog`
FROM `m_tool` `a`
LEFT JOIN `m_company` `b` ON `a`.`company_id`=`b`.`id`
LEFT JOIN `m_file` `c` ON `a`.`region_id`=`c`.`id`
LEFT JOIN `m_file` `d` ON `a`.`division_id`=`d`.`id`
LEFT JOIN `m_person` `e` ON `a`.`person_id`=`e`.`id`
LEFT JOIN `user_log` `x` ON `x`.`unique` = `a`.`unique` AND `x`.`menu` = "equipment" AND `x`.`username` = "Administrator"
WHERE `a`.`param` = 'equipment'
AND `a`.`company_id` = '9'
AND `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `a`.`code`

    public function getInventory($menu, $active = false, $company = false, $category = false)
    {
        $builder = $this->db->table('m_inventory a');
        $builder->select('a.*, b.code as company, c.name as region, d.name as division, x.id as xLog');
        if ($active == true) $builder->where('substring(a.adaptation, 2, 1)', '1')->where('substring(a.adaptation, 3, 1)', '1');
        if ($company == true) $builder->where('a.company_id', $company);
        if ($category == true) $builder->where('a.category', $category);
        $strX = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.username = "' . decrypt(session()->username) . '"' : '');
        $builder->where(['a.deleted_at' => null]);
        $builder->join('m_company b', 'a.company_id=b.id', 'left');
        $builder->join('m_file c', 'a.region_id=c.id', 'left');
        $builder->join('m_file d', 'a.division_id=d.id', 'left');
        $builder->join('user_log x', 'x.unique = a.unique' . $strX, 'left');
        $builder->groupBy('a.id')->orderBy('a.code');
        return $builder->get()->getResult();
---
SELECT `a`.*, `b`.`code` as `company`, `c`.`name` as `region`, `d`.`name` as `division`, `x`.`id` as `xLog`
FROM `m_inventory` `a`
LEFT JOIN `m_company` `b` ON `a`.`company_id`=`b`.`id`
LEFT JOIN `m_file` `c` ON `a`.`region_id`=`c`.`id`
LEFT JOIN `m_file` `d` ON `a`.`division_id`=`d`.`id`
LEFT JOIN `user_log` `x` ON `x`.`unique` = `a`.`unique` AND `x`.`menu` = "inventory" AND `x`.`username` = "Administrator"
WHERE `a`.`company_id` = '1'
AND `a`.`category` = 'Kategori satu'
AND `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `a`.`code`

    public function getItem($menu, $param = false, $category = false, $active = false, $serial = false)
    {
        $builder = $this->db->table('m_item a');
        $builder->select('a.*, x.id as xLog');
        if ($param == true) $builder->where('a.param', $param);
        if ($category == true) $builder->where('a.category', $category);
        if ($active == true) $builder->where('substring(a.adaptation, 2, 1)', '1')->where('substring(a.adaptation, 3, 1)', '1');
        $strX = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.username = "' . decrypt(session()->username) . '"' : '');
        $builder->where(['a.deleted_at' => null]);
        $builder->join('user_log x', 'x.unique = a.unique' . $strX, 'left');
        $builder->groupBy('a.id')->orderBy('a.param, a.category, a.code');
        return $builder->get()->getResult();
---
SELECT `a`.*, `x`.`id` as `xLog`
FROM `m_item` `a`
LEFT JOIN `user_log` `x` ON `x`.`unique` = `a`.`unique` AND `x`.`menu` = "item" AND `x`.`username` = "Administrator"
WHERE `a`.`param` = 'item'
AND `a`.`category` = 'Kategori'
AND `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `a`.`param`, `a`.`category`, `a`.`code`

    public function getSerial($menu)
    {
        $builder = $this->db->table('m_serial a');
        $builder->select('a.*, b.name as itemName, c.code as toolNumber, x.id as xLog');
        $strX = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.username = "' . decrypt(session()->username) . '"' : '');
        $builder->where(['a.deleted_at' => null]);
        $builder->join('m_item b', 'a.item_id=b.id', 'left');
        $builder->join('m_tool c', 'a.tool_id=c.id', 'left');
        $builder->join('user_log x', 'x.unique = a.unique' . $strX, 'left');
        $builder->groupBy('a.id')->orderBy('b.code, a.serial');
        return $builder->get()->getResult();
---
SELECT `a`.*, `b`.`name` as `itemName`, `c`.`code` as `toolNumber`, `x`.`id` as `xLog`
FROM `m_serial` `a`
LEFT JOIN `m_item` `b` ON `a`.`item_id`=`b`.`id`
LEFT JOIN `m_tool` `c` ON `a`.`tool_id`=`c`.`id`
LEFT JOIN `user_log` `x` ON `x`.`unique` = `a`.`unique` AND `x`.`menu` = "serial" AND `x`.`username` = "Administrator"
WHERE `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `b`.`code`, `a`.`serial`

    public function getPerson($menu, $employee, $active = false, $osm = false, $company = false, $category = false, $position = false)
    {
        $builder = $this->db->table('m_person a');
        $builder->select('a.*, b.code as company, c.name as region, d.name as division, e.name as position, x.id as xLog');
        if ($active == true) $builder->where('substring(a.adaptation, 2, 1)', '1')->where('substring(a.adaptation, 3, 1)', '1');
        if ($company == true) $builder->where('a.company_id', $company);
        if ($category == true) $builder->where('a.category', $category);
        if ($position == true) $builder->where('a.position_id', $position);
        if ($employee == '1') $builder->where('substring(a.is_alias, 4, 1)', '1');
        if ($osm == '1') $builder->where('substring(a.is_alias, 5, 1)', '1');
        $strX = ($menu != '' ? ' AND x.menu = "' . $menu . '" AND x.username = "' . decrypt(session()->username) . '"' : '');
        $builder->where(['a.deleted_at' => null]);
        $builder->join('m_company b', 'a.company_id=b.id', 'left');
        $builder->join('m_file c', 'a.region_id=c.id', 'left');
        $builder->join('m_file d', 'a.division_id=d.id', 'left');
        $builder->join('m_file e', 'a.position_id=e.id', 'left');
        $builder->join('user_log x', 'x.unique = a.unique' . $strX, 'left');
        $builder->groupBy('a.id')->orderBy('a.category, a.code');
        return $builder->get()->getResult();
---
SELECT `a`.*, `b`.`code` as `company`, `c`.`name` as `region`, `d`.`name` as `division`, `e`.`name` as `position`, `x`.`id` as `xLog`
FROM `m_person` `a`
LEFT JOIN `m_company` `b` ON `a`.`company_id`=`b`.`id`
LEFT JOIN `m_file` `c` ON `a`.`region_id`=`c`.`id`
LEFT JOIN `m_file` `d` ON `a`.`division_id`=`d`.`id`
LEFT JOIN `m_file` `e` ON `a`.`position_id`=`e`.`id`
LEFT JOIN `user_log` `x` ON `x`.`unique` = `a`.`unique` AND `x`.`menu` = "employee" AND `x`.`username` = "Administrator"
WHERE `a`.`company_id` = '9'
AND `a`.`position_id` = '4'
AND substring(a.is_alias, 4, 1) = '1'
AND `a`.`deleted_at` IS NULL
GROUP BY `a`.`id`
ORDER BY `a`.`category`, `a`.`code`

    public function loadPerson($isi, $customer, $supplier, $subcontractor, $employee, $osm)
    {
        $builder = $this->db->table('m_person');
        $builder->where("(code like \"%$isi%\" or eid like \"%$isi%\" or name like \"%$isi%\")");
        $builder->where('substring(adaptation, 2, 1)', '1')->where('substring(adaptation, 3, 1)', '1');
        if ($osm == '1') $builder->Where('substring(is_alias, 5, 1)', '1');
        $builder->groupStart();
        if ($customer === '1') $builder->orWhere('substring(is_alias, 1, 1)', '1');
        if ($supplier === '1') $builder->orWhere('substring(is_alias, 2, 1)', '1');
        if ($subcontractor === '1') $builder->orWhere('substring(is_alias, 3, 1)', '1');
        if ($employee === '1') $builder->orWhere('substring(is_alias, 4, 1)', '1');
        $builder->groupEnd();
        $builder->orderBy('code');
        $builder->limit(quantityLimit);
        return $builder->get()->getResult();
---
SELECT *
FROM `m_person`
WHERE (`code` like "%a%" or `eid` like "%a%" or `name` like "%a%")
AND substring(adaptation, 2, 1) = '1'
AND substring(adaptation, 3, 1) = '1'
AND   (
substring(is_alias, 2, 1) = '1'
OR substring(is_alias, 3, 1) = '1'
OR substring(is_alias, 4, 1) = '1'
 )
ORDER BY `code`
 LIMIT 20