app/Models/admin/ConfigModel.php

SELECT `m_config`.*, `m_user`.`code` as `user`
FROM `m_config`
LEFT JOIN `m_user` ON `m_config`.`save_by` = `m_user`.`id`
WHERE `m_config`.`param` = 'level approve'
---
    public function getConfig($param = false)
    {
        $query = $this->db->table('m_config');
        $query->select('m_config.*, m_user.code as user');
        $query->join('m_user', 'm_config.save_by = m_user.id', 'left');
        if ($param != false) $query->where('m_config.param', $param);
        return $query->get()->getResultArray();