app/Models/admin/KonfigurasiModel.php

SELECT `m_konfigurasi`.*, `m_user`.`kode` as `user`
FROM `m_konfigurasi`
LEFT JOIN `m_user` ON `m_konfigurasi`.`save_by` = `m_user`.`id`
WHERE `m_konfigurasi`.`param` = 'jumlah setuju'
---
    public function getKonfigurasi($param = false)
    {
        $query = $this->db->table('m_konfigurasi');
        $query->select('m_konfigurasi.*, m_user.kode as user');
        $query->join('m_user', 'm_konfigurasi.save_by = m_user.id', 'left');
        if ($param !== false) $query->where('m_konfigurasi.param', $param);
        return $query->get()->getResultArray();