app/Models/admin/LogModel.php

INSERT INTO `user_log` (`unique`, `username`, `menu`, `action`, `data`, `notes`, `web_address`, `ip_address`, `user_agent`, `last_act`, `created_at`, `updated_at`) VALUES ('ed32bc57c53ea5b755276f74892fd80604b1038ed476ef6c96ae594d97c5ed06', 'Administrator', 'item', 'Read', 'AAAA-AAAA.1111 ; Spare Part AA 11', '', 'http://localhost:8080/item', '::1', 'Edge 133.0.0.0, Windows 10, ', 1739934641, '2025-02-19 10:17:50', '2025-02-19 10:17:50')
---
    public function saveLog($action, $unique = '', $data = '', $notes = '', $source = 'a')
    {
        $session = \Config\Services::session();
        $request = \Config\Services::request();

        $this->save([
            'unique' => $unique,
            'username' => decrypt($session->get()['username'] ?? ''),
            'menu' => $this->urls[1],
            'action' => $action,
            'data' => $data,
            'notes' => $notes,
            'source' => $source,
            'web_address' => $session->get()['_ci_previous_url'] ?? '',
            'ip_address' => getIP(),
            'user_agent' => $request->getUserAgent()->getBrowser() . ' ' . $request->getUserAgent()->getVersion() .
                ', ' . $request->getUserAgent()->getPlatform() . ', ' . $request->getUserAgent()->getMobile(),
            'last_act' => $session->get()['__ci_last_regenerate'] ?? '',
        ]);