app/Models/admin/LogModel.php

INSERT INTO `user_log` (`idunik`, `usernama`, `menu`, `aksi`, `data`, `catatan`, `alamat`, `ip_address`, `user_agent`, `last_act`, `created_at`, `updated_at`) VALUES ('', 'Administrator', 'login', 'Login', '', '', 'http://localhost:8080/login', '::1', 'Edge 128.0.0.0, Windows 10, ', 1724907750, '2024-08-29 12:02:46', '2024-08-29 12:02:46')
---
    public function saveLog($aksi, $idunik, $data = '', $catatan = '')
    {
        $session = \Config\Services::session();
        $request = \Config\Services::request();

        $this->save([
            'idunik' => $idunik,
            'usernama' => $session->get()['usernama'] ?? '',
            'menu' => $this->urls[1],
            'aksi' => $aksi,
            'data' => $data,
            'catatan' => $catatan,
            'alamat' => $session->get()['_ci_previous_url'] ?? '',
            'ip_address' => getIP(),
            'user_agent' => $request->getUserAgent()->getBrowser() . ' ' . $request->getUserAgent()->getVersion() .
                ', ' . $request->getUserAgent()->getPlatform() . ', ' . $request->getUserAgent()->getMobile(),
            'last_act' => $session->get()['__ci_last_regenerate'] ?? '',
        ]);