app/Models/admin/RoleModel.php

    public function getRole($id)
    {
        return $this->where(['id' => $id])->first();
---
SELECT *
FROM `m_role`
WHERE `id` = ''
AND `m_role`.`deleted_at` IS NULL
 LIMIT 1