app/Models/admin/UserModel.php

    public function getUser($username)
    {
        return $this->db->table('m_user')
            ->select('m_user.*')
            ->where('m_user.code', $username)->where('substring(m_user.adaptation, 2, 1)', '1')->where('substring(m_user.adaptation, 3, 1)', '1')
            ->where('m_user.deleted_at', null)
            ->get()->getRowArray();
---
SELECT `m_user`.*
FROM `m_user`
WHERE `m_user`.`code` = 'Administrator'
AND substring(m_user.adaptation, 2, 1) = '1'
AND substring(m_user.adaptation, 3, 1) = '1'
AND `m_user`.`deleted_at` IS NULL